spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_does_not_have_Nexus_Jurisdition_Registered/origin_country_tax_is_returned.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R591641382","DocDate":"2017-04-17","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #24 - 6708","TaxCode":"PC030000","ItemCode":"SKU-24","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R591641382","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 17 Apr 2017 21:20:24 GMT
      Content-Length:
      - '652'
      Set-Cookie:
      - TS017f1821=01a8ddc44e75fec077045041fb99c143a305cb5e7624b116a2fd770633721b88808ca0326f1a9f09f9b1c78ab5440f13e061259a9e;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++uv9w99P93XsHe/rF06zlL/Z2dh9s7+xv7z7AF2+KRd602WIVfvVm
        b/fR3s6jvf3xvXt793fv7f8UN67arDxeVOtly833x/cf2s+fFs3UfLNjPz19
        ly9WbVEtw4/fZO+ySSn4BFDoC3x4f7zvf3SSldN1SQOY+V9m754Xy7yhj76X
        EFXwx4uK/vpod/v5mbYw5Hh5snNvhx79OJsUZdFe45u2Xuf49AkhP8vq6+f5
        ZV7ii58qVvfxRX8I/aECogxn99PxPR7OK0IXH+yM9/aoY9MOH90bf6p/hQNz
        nz/N26wo7dBO0FvN6J69QZNX+YUiJH9/Z10XzZvrFfdoWpvPDQ2kKUH/Grgy
        oBfZgpudvTl+/vvgU2pjPnvdZiDfLGVYvyT5fvJLkhGh7mZlb/vZK33JYPTs
        FXVGj378szcrB2MWA8aN/oyMc3d8oH+Fc+I+/+HMya0xZTCG+redke8n0uZ4
        NqtJZzjh0Q/oz48OUiJ6mV/i1dk6fZmVWcHaRdsY1J+S4sDHJzplLzNCiD/Q
        sdJnMuMvK1IxpXnvwf2dnV18THgIzc6Y0ns793cOWLJ5aKY5gRBO0u7x2b19
        wrG+qNJZflEW6XE5KX5Q4E1tY97lbgx+z8qqzpdTZisPRZmBEEWgYkjeRfEh
        fxGgSCAcaSN69pck/w9eGHVltQUAAA==
    http_version: 
  recorded_at: Mon, 17 Apr 2017 21:20:24 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R591641382","DocDate":"2017-04-17","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #24 - 6708","TaxCode":"PC030000","ItemCode":"SKU-24","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R591641382","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 17 Apr 2017 21:20:24 GMT
      Content-Length:
      - '650'
      Set-Cookie:
      - TS017f1821=01a8ddc44e22182f325d6d1220f60d34f1f4fd0ca2289e41155f230992039f51c9be6bda6259fde1e55ac0fb978b3278b2f32a17ac;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++uv9w99P93XsHe/rF06zlL/Z2dh9s7+xv7z7AF2+KRd602WIVfvVm
        b/fR3s6jvfvjnb29e3v37/0UN67arDxeVOtly833x/cf2s+fFs3UfLNjPz19
        ly9WbVEtw4/fZO+ySSn4BFDoC3x4f7zvf3SSldN1SQOY+V9m754Xy7yhj76X
        EFXwx4uK/vpod/v5mbYw5Hh5snNvhx79OJsUZdFe45u2Xuf49AkhP8vq6+f5
        ZV7ii58qVvfxRX8I/aECogxn99PxPR7OK0IXH+yM9/aoY9MOH90bf6p/hQNz
        nz/N26wo7dBO0FvN6J69QZNX+YUiJH9/Z10XzZvrFfdoWpvPDQ2kKUH/Grgy
        oBfZgpudvTl+/vvgU2pjPnvdZiDfLGVYvyT5fvJLkhGh7mZlb/vZK33JYPTs
        FXVGj378szcrB2MWA8aN/oyMc3d8oH+Fc+I+/+HMya0xZTCG+redke8n0uZ4
        NqtJZzjh0Q8MWk9JKQCcQZs+spMn4zxj6uzt3N85YGlkdMzr0lZh4oODlCay
        zC+BzmydvszKrGCNdaLz/TKj1/HBy4rUUWkAPbi/s7NLuIOTFJz5ahetPfws
        Jbv4PWTiBfhJWwWID+7tE4L1RZXO8ouySI/LSfGDAm0Mfs/Kqs6XU+bJEEV0
        sUMoGtJG9OwvSf4fwOqykLUFAAA=
    http_version: 
  recorded_at: Mon, 17 Apr 2017 21:20:25 GMT
recorded_with: VCR 3.0.3
