spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_does_not_have_Nexus_Jurisdition_Registered/TotalTax_is_equal_to_order_included_tax_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R331879399","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #23 - 8009","TaxCode":"PC030000","ItemCode":"SKU-23","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R331879399","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:41:44 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '651'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b09fPGmWORNmy1WwVe7b/Z2H+3T//bGD/Z27z082P0pbly1WXm8qNbLlpvvj+8/tJ8/LZqp+WbHfnr6Ll+s2qJahh+/yd5lk1LwCaDQF/jw/njf/+gkK6frkgYw87/M3sXHRIM1JHh1797uwYOH9x5KD9m758Uyb+ib7yVELvzxoqK/Ptrdfn6mLcyrL0927u3Qox9nk6Is2mt809brHJ8+oeHOsvr6eX6Zl/jip4rVfXzRH3SfOIAoBNj9dHyP0Xulo9kZ7+1Rx6YdPro3/lT/CknhPn+at1lR2qGdoLea0T17gyav8gtFSP7+zroumjfXK+7RtDafGxpIU4L+NXBlQC+yBTc7e3P8/PfBp9TGfPa6zUC+Wcqwfkny/eSXJCNC3Z+VZ6/0JYPRs1fUGT368c/erByMmZcYN/ozMs7d8YH+Fc6J+/yHMye3xpTBGOrfdka+n0ib49msJmXihEc/oD8/OkiJ6GV+iVdn6/RlVmYFqx1tY1B/SqoGH5/olL3MCCH+QMdKn8mMv6xIKZXmvQf3d3Z28THhITQ7Y0rv7dzfOWBdwEMzzQmEcJJ2j8/u7ROO9UWVzvKLskiPy0nxgwJvahvzLndj8HtWVnW+nDJbeSjKDIQoAhVD8i6KD/mLAEUCAdL+kuT/AaXHYzK1BQAA
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:41:40 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R331879399","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #23 - 8009","TaxCode":"PC030000","ItemCode":"SKU-23","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R331879399","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:41:46 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '651'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b09fPGmWORNmy1WwVe7b/Z2H+3T//bHD/cPHu7v7f4UN67arDxeVOtly833x/cf2s+fFs3UfLNjPz19ly9WbVEtw4/fZO+ySSn4BFDoC3x4f7zvf3SSldN1SQOY+V9m7+JjosEaEry6d2/34MHDew+lh+zd82KZN/TN9xIiF/54UdFfH+1uPz/TFubVlyc793bo0Y+zSVEW7TW+aet1jk+f0HBnWX39PL/MS3zxU8XqPr7oD7pPHEAUAux+Or7H6L3S0eyM9/aoY9MOH90bf6p/haRwnz/N26wo7dBO0FvN6J69QZNX+YUiJH9/Z10XzZvrFfdoWpvPDQ2kKUH/GrgyoBfZgpudvTl+/vvgU2pjPnvdZiDfLGVYvyT5fvJLkhGh7s/Ks1f6ksHo2SvqjB79+GdvVg7GzEuMG/0ZGefu+ED/CufEff7DmZNbY8pgDPVvOyPfT6TN8WxWkzJxwqMf0J8fHaRE9DK/xKuzdfoyK7OC1Y62Mag/JVWDj090yl5mhBB/oGOlz2TGX1aklErz3oP7Ozu7+JjwEJqdMaX3du7vHLAu4KGZ5gRCOEm7x2f39gnH+qJKZ/lFWaTH5aT4QYE3tY15l7sx+D0rqzpfTpmtPBRlBkIUgYoheRfFh/xFgCKBAGl/SfL/ACLJLBS1BQAA
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:41:42 GMT
recorded_with: VCR 4.0.0
