spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_has_Nexus_Jurisdition_Registered/TotalTax_is_equal_to_order_included_tax_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R392171710","DocDate":"2019-01-28","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #20 - 2456","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R392171710","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1133'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 28 Jan 2019 07:30:22 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '669'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b0DfPGmWORNmy1W4Vdvdh48urfzaPfheOfh/f2d/Z/itlWblceLar1sufX++IHAwOdPi2Zqvtmxn56+yxertqiW4cdvsnfZpBR0Aij0BT68P97b9T87ycrpuqQBzIJvs3fxQdFoDQ1e3Xu4t/uA/pPOs3fPi2Xe0DffS4he+ONFRX99tLv9/ExbmFdfnuzc26FHP84mRVm01/imrdc5Pn1CA55l9fXz/DIv8cVPFav7+KI/7D55AFFIsPvp+P4ePnulo9mhAVLHph0+ujfef6B/hsTwvniat1lR2sGdoL+aEX7xHE1e5ReKkvz9nXVdNG+uV9ynaW0+N1SQpgT962DLkF5kC2734vTNt09fPT9+8fQ1vqOm5pvXbQY6zlIG+UuS7ye/JBnRCPzpefZKXzKIPXtFfdKjH//sTc/BeO9TfMTI0d+R8e6OH+zrn+HseF/8cGbnPZBlQGYK3m9yvp9Im+PZrCYN4wRKP6A/Pzp4mL4o8vVVvpwVP/0WQPVLg/tTUjz4+ESn7XjRtHk9yxb8oQ6YPpcxvqxITZXm3d2d3b30ixN8QWgI6c6Y4ns793cePsQXPD7zAgERnlIk8Nm9/fRJVV9U6Sy/KIv0uJwUPyjwprYx77KyMVg+K6s6X06ZwTwkz97ggxDJ+4QkS0oMRZ6RAEUCAcr+kuT/AdqwTtzJBQAA
    http_version: 
  recorded_at: Mon, 28 Jan 2019 07:30:21 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R392171710","DocDate":"2019-01-28","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #20 - 2456","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R392171710","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1133'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 28 Jan 2019 07:30:23 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '665'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b0DfPGmWORNmy1W4Vdvdh48urfzaO/T8f1Pd3c/fbD3U9y4arPyeFGtly033x8/ECD4/GnRTM03O/bT03f5YtUW1TL8+E32LpuUgk8Ahb7Ah/fHe7v+ZydZOV2XNIJZ8G32Lj4qGq4hwqt7D/d2H9B/0nn27nmxzBv65nsJEQx/vKjor492t5+faQvz6suTnXs79OjH2aQoi/Ya37T1OsenT2jAs6y+fp5f5iW++KlidR9f9IfdJw8gCgl2icx7+OyVjmaHBkgdm3b46N54/4H+GRLD++Jp3mZFaQd3gv5qRvjFczR5lV8oSvL3d9Z10by5XnGfprX53FBBmhL0r4MtQ3qRLbjdi9M33z599fz4xdPX+I6amm9etxnoOEsZ5C9Jvp/8kmREI/Cn59krfckg9uwV9UmPfvyzNz0H471P8REjR39Hxrs7frCvf4az433xw5md90CWAZkpeL/J+X4ibY5ns5pUjBMo/YD+/OjgYfqiyNdX+XJW/PRbANUvDe5PSfPgYzM2+kiG87IilVSaZrs7u3vpFyf4gnoUKp0xcfd27u88fIgveCjmBQFyosxwvGjavJ5lC0IdPKVI4Kt7++mTqr6o0ll+URbpcTkpflDgXW1jALKy8bA8e4MPQizvE5YsFTEcmfoBjgLC4PisrOp8OTXU/X8A6dYRccoFAAA=
    http_version: 
  recorded_at: Mon, 28 Jan 2019 07:30:23 GMT
recorded_with: VCR 4.0.0
