spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_does_not_have_Nexus_Jurisdition_registered/tax_detail_country_equals_to_IT.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R238619637","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #13 - 9801","TaxCode":"PC030000","ItemCode":"SKU-13","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R238619637","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:40:57 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '637'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b09fPGmWORNmy1WwVe7b/Z2H+3vPLr/6fje/u7ewd6Dn+LGVZuVx4tqvWy5+cPxw4f286dFMzXf7NhPT9/li1VbVMvw4zfZu2xSCj4BFPoCHwYtT7Jyui4J/Zn7KnsXHw8N1Az/1d69g093H3567wG+oDeeF8u8oW++lxCp8MeLiv76aHf7+Zm2MK++PNm5t0OPfpxNirJor/FNW69zfPqEhjrL6uvn+WVe4oufKlb38UV/wH3CAKIMftcM/pWOZmdM3dKDz6gdf6S/D5Ahb7OitMM6QU81o3r2Bk1e5ReKjPz9nXVdNG+uV9ybaW0+N+OXpgT9vfFkMC+yBTc6e3P8/PfBp9TCfPZTeV2lDOWXJN9PfkkyIqT9uXj2Sl8wuDx7Rd3Qox//LM4Ff8Co0V9DA6Tff04ngru7CUmGYSh+m1n4fiLfH89mNakMJyb6Af350b37O+nxZXqSE6ZZCYD6pUH2KWkSfHyi8/MmW2R1sZxV/KGOkD4/4Sl+WZHeKc2790ngmMEICaHUGVN3b+f+7t49fMFjMs0JhLCOooDP7u2nT6r6okpn+UVZpMflpPhBgTe1jXl3F58ZHJ+VVZ0vp8xHHopC9xBFQsVSuoPizkP+IkCRQICuvyT5fwD6i1VjmAUAAA==
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:40:53 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R238619637","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #13 - 9801","TaxCode":"PC030000","ItemCode":"SKU-13","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R238619637","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:40:59 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '636'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b09fPGmWORNmy1WwVe7b/Z2H+3vPLp/MN7bf7C383D3p7hx1Wbl8aJaL1tu/nD88KH9/GnRTM03O/bT03f5YtUW1TL8+E32LpuUgk8Ahb7Ah0HLk6ycrktCf+a+yt7Fx0MDNcN/tXfv4NPdh5/ee4Av6I3nxTJv6JvvJUQq/PGior8+2t1+fqYtzKsvT3bu7dCjH2eToizaa3zT1uscnz6hoc6y+vp5fpmX+OKnitV9fNEfcJ8wgCiD3zWDf6Wj2RlTt/TgM2rHH+nvA2TI26wo7bBO0FPNqJ69QZNX+YUiI39/Z10XzZvrFfdmWpvPzfilKUF/bzwZzItswY3O3hw//33wKbUwn/1UXlcpQ/klyfeTX5KMCGl/Lp690hcMLs9eUTf06Mc/i3PBHzBq9NfQAOn3n9OJ4O5uQpJhGIrfZha+n8j3x7NZTSrDiYl+QH9+dO/+Tnp8mZ7khGlWAqB+aZB9SpoEH5/o/LzJFlldLGcVf6gjpM9PeIpfVqR3SvPufRI4ZjBCQih1xtTd27m/u3cPX/CYTHMCIayjKOCze/vpk6q+qNJZflEW6XE5KX5Q4E1tY97dxWcGx2dlVefLKfORh6LQPUSRULGU7qC485C/CFAkEKDrL0n+HzzMiGKYBQAA
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:40:55 GMT
recorded_with: VCR 4.0.0
