spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_does_not_have_Nexus_Jurisdition_registered/total_tax_is_0_since_utah_is_not_in_jurisdiction.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R343970852","DocDate":"2019-01-24","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #3 - 2488","TaxCode":"PC030000","ItemCode":"SKU-3","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R343970852","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1129'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 24 Jan 2019 11:55:34 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '635'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b19fPGmWORNmy1W4Vdvdncf3b//aO/h+GDnYG/34OCnuHHVZuXxolovW27+cPzwof38adFMzTc79tPTd/li1RbVMvz4TfYum5SCTwCFvsCHQcuTrJyuS0J/5r7K3sXHQwM1w391b//ewwc7B/f38AW98bxY5g19872ESIU/XlT010e728/PtIV59eXJzr0devTjbFKURXuNb9p6nePTJzTUWVZfP88v8xJf/FSxuo8v+gPuEwYQZfC7ZvCvdDQ7Y+qWHnxG7fgj/X2ADHmbFaUd1gl6qhnVszdo8iq/UGTk7++s66J5c73i3kxr87kZvzQl6O+NJ4N5kS240dmb4+e/Dz6lFuazn8rrKmUovyT5fvJLkhEh7c/Fs1f6gsHl2Svqhh79+GdxLvgDRo3+Ghog/f5zOhHc3U1IMgxD8dvMwvcT+f54NqtJZTgx0Q/oz4/u3d9Jjy/Tk5wwzUoA1C8Nsk9Jk+DjE52fN9kiq4vlrOIPdYT0+QlP8cuK9E5p3r1PAscMRkgIpc6Yuns793f37uELHpNpTiCEdRQFfHZvP31S1RdVOssvyiI9LifFDwq8qW3Mu7v4zOD4rKzqfDllPvJQFLqHKBIqltIdFHce8hcBigQCdP0lyf8DvY5aWJgFAAA=
    http_version: 
  recorded_at: Thu, 24 Jan 2019 11:55:34 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R343970852","DocDate":"2019-01-24","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #3 - 2488","TaxCode":"PC030000","ItemCode":"SKU-3","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R343970852","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1129'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 24 Jan 2019 11:55:36 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '634'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1NZ++urd/7+GDnYP7e/rF06zlL/Z2dh9u7+xu7+3jizfFIm/abLEKv3qzu/vo/v1Hew/HB/fvfXrv4N5PceOqzcrjRbVettz84fjhQ/v506KZmm927Ken7/LFqi2qZfjxm+xdNikFnwAKfYEPg5YnWTldl4T+zH2VvXteLPOGPvheQhTBHy8q+uuj3e3nZ9rCkOLlyc69HXr042xSlEV7jW/aep3j0yeE+Cyrr5/nl3mJL36qWN3HF330+8MERBnKrhnKK0IWH+yMqVt68Bm144/09/ignuZtVpR2WCfoqWZUz96gyav8QpGRv7+zrovmzfWKezOtzedm/NKUoL83ngzmRbbgRmdvjp//PviUWpjPfiqvq5Sh/JLk+8kvSUaEtD8Xz17pCwaXZ6+oG3r045/FueAPGDX6a2iA9PvP6URwdzchyTAMxW8zC99P5Pvj2awmzeDERD8w+Dwl0Qcogy99dMIT9rIinVCaZvdJfJhdCKSM+4xptbdzf3fvHr5gDE1zAaFd4YN793fS48v0JKdOshJfnuicv8kWWV0sZxUhDtbRlwykXW7rkBP6hcgREpZiHeR2HvIXAXICQvvBB/f20ydVfVGls/yiLNLjclL8oEAbg+Ozsqrz5VRoS59TPxFV+kuS/wf82MXjmAUAAA==
    http_version: 
  recorded_at: Thu, 24 Jan 2019 11:55:36 GMT
recorded_with: VCR 4.0.0
